src/InformationRegisters/кфкПараметрыКонтроляИнтеграции/кфкПараметрыКонтроляИнтеграции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>кфкПараметрыКонтроляИнтеграции</name>
  <resources>
    <name>ВремяSLAВходящих</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВремяSLAИсходящих</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИдентификаторЧатаТГ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТокенБотаТГ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
</mdclass:InformationRegister>

src/InformationRegisters/кфкПараметрыКонтроляИнтеграции/ManagerModule.bsl
// @strict-types

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ВыбраннаяФорма = Метаданные.Обработки.кфкПанельАдминистрирования.ОсновнаяФорма;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Получить параметры.
// 
// Возвращаемое значение:
//  Структура - Получить параметры:
// * ВремяSLAИсходящих - Число - ВремяSLAИсходящих
// * ВремяSLAВходящих - Число - ВремяSLAВходящих
// * ИдентификаторЧатаТГ - Строка - ИдентификаторЧатаТГ
// * ТокенБотаТГ - Строка - ТокенБотаТГ
Функция ПолучитьПараметры() Экспорт
	
	Результат = Новый Структура;
	
	Результат.Вставить("ВремяSLAИсходящих", 10);
	Результат.Вставить("ВремяSLAВходящих", 10);
	
	Результат.Вставить("ИдентификаторЧатаТГ", "");
	Результат.Вставить("ТокенБотаТГ", "");
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	кфкПараметрыКонтроляИнтеграции.ВремяSLAВходящих,
	|	кфкПараметрыКонтроляИнтеграции.ВремяSLAИсходящих,
	|	кфкПараметрыКонтроляИнтеграции.ИдентификаторЧатаТГ,
	|	кфкПараметрыКонтроляИнтеграции.ТокенБотаТГ
	|ИЗ
	|	РегистрСведений.кфкПараметрыКонтроляИнтеграции КАК кфкПараметрыКонтроляИнтеграции";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
		
	Иначе
		ОбновитьПараметры(Результат);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ОбновитьПараметры(НовыеПараметры) Экспорт
	
	Набор = СоздатьНаборЗаписей();
	ЗаполнитьЗначенияСвойств(Набор.Добавить(), НовыеПараметры);
	Набор.ОбменДанными.Загрузка = Истина;
	Набор.Записать();
		
КонецПроцедуры

#КонецОбласти

#КонецЕсли
